Revit 2026 API

# TransformHasReflection Property

---

The boolean value that indicates whether this transformation produces reflection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasReflection { get; }
```
```vb
Public ReadOnly Property HasReflection As Boolean
	Get
```
```cpp
public:
property bool HasReflection {
	bool get ();
}
```
```fsharp
member HasReflection : bool with get
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when this transformation is not conformal and the reflection is undefined. |

Reflection transformation changes the handedness of a coordinate system.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace